Catalogs/Задача.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.14">
	<Catalog>
		<Properties>
			<Name>Задача</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Заявка</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.БП_Поручение</v8:Type>
						<v8:Type>cfg:DocumentRef.БП_Оповещение</v8:Type>
						<v8:Type>cfg:DocumentRef.Д_ЗаявкаНаАвансовыйОтчет</v8:Type>
						<v8:Type>cfg:DocumentRef.Д_Бюджет</v8:Type>
						<v8:Type>cfg:DocumentRef.Д_ЗаявкаНаСогласованиеДоговора</v8:Type>
						<v8:Type>cfg:DocumentRef.Д_СогласованиеМассиваДокументов</v8:Type>
						<v8:Type>cfg:DocumentRef.Д_ЗаявкаНаОплату</v8:Type>
						<v8:Type>cfg:DocumentRef.Д_ЗаявкаНаКорректировкуБюджета</v8:Type>
						<v8:Type>cfg:DocumentRef.Д_СлужебнаяЗаписка</v8:Type>
						<v8:Type>cfg:DocumentRef.Д_ЗаявкаНаФинансирование</v8:Type>
						<v8:Type>cfg:DocumentRef.Д_ЗаявкаНаКадровоеДвижение</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Предприятие</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Предприятия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарии</Name>
					<Comment>История переписки</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаИсполнения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РезультатВыполнения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГруппыПользователей</v8:Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Гиперссылка</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОткрыватьФорму</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Новая</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СрокВыполнения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеДелегировать</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВРаботе</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОбязательныйКПрикреплению</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИДГруппы</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РольПользователя</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РолиИсполнителей</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Проект</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Исполнитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГруппыПользователей</v8:Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Должность</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Д_Должности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РольИсполнителя</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РолиИсполнителей</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БизнесПроцесс</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СогласованиеОбщее</v8:Type>
						<v8:Type>cfg:CatalogRef.ЗаявкиАдминистратору</v8:Type>
						<v8:Type>cfg:CatalogRef.УтверждениеБюджета</v8:Type>
						<v8:Type>cfg:CatalogRef.Согласование2</v8:Type>
						<v8:Type>cfg:CatalogRef.Согласование1</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТочкаМаршрута</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЗаявкиАдминистраторуТочкиМаршрута</v8:Type>
						<v8:Type>cfg:EnumRef.СогласованиеОбщееТочкиМаршрута</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>cfg:EnumRef.Согласование3ТочкиМаршрута</v8:Type>
						<v8:Type>cfg:EnumRef.УтверждениеБюджетаТочкиМаршрута</v8:Type>
						<v8:Type>cfg:EnumRef.Согласование2ТочкиМаршрута</v8:Type>
						<v8:Type>cfg:EnumRef.Согласование1ТочкиМаршрута</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Выполнена</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Дата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Номер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>11</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ПараметрыЗадачи</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Параметр</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/Задача/Forms/ФормаУстановкиСрока/Ext/Form/Module.bsl
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	НовыйСрокВыполнения = Макс(СрокВыполнения, ДатаНачала);
	//ВРаботе = Истина;
КонецПроцедуры

&НаКлиенте
Процедура УстановитьИЗакрыть(Команда)
	Если НовыйСрокВыполнения < ТекущаяДата() Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Новый срок выполнения не может быть меньше текущей даты";
		Сообщение.Поле = "НовыйСрокВыполнения";
		Сообщение.УстановитьДанные(ЭтаФорма);
		Сообщение.Сообщить();
		Отказ = Истина;
		Возврат;
	ИначеЕсли НовыйСрокВыполнения > СрокВыполнения И НЕ НеДелатьЗапросНаНовыйСрок Тогда
		Если Вопрос("Установить более поздний срок выполнения? При этом инициатор бизнес процесса будет оповещен.", РежимДиалогаВопрос.ДаНет) = КодВозвратаДиалога.Да  Тогда
			//ЗаписатьЗадачу();
			//Оповестить("ОбновитьСписокЗадач");
			ЭтаФорма.Закрыть();
			//Оповестить("ЗакрытьФормуСправочники");
			
			БПСервер.СоздатьОповещение(ТекАвтор, "Пользователь " + Строка(БюджетныйНаСервере.ПолучитьПользователя()) + " запрашивает установку нового срока выполнения по задаче """ + Строка(ТекЗадача) + """:
			|Старый срок: " + Строка(СрокВыполнения) + "
			|Новый срок: " + Строка(НовыйСрокВыполнения) + "
			|Причина: " + Строка(ПричинаОтсрочки) + "
			|
			|Принять новый срок по задаче?", "Запрос на изменение срока выполнения Справочники", Заявка, Истина, , ТекЗадача, Новый Структура("СтарыйСрокСправочники, НовыйСрокСправочники", СтарыйСрок, НовыйСрокВыполнения) );
			
			Предупреждение("Запрос на изменение срока успешно отправлен инициатору бизнес-процесса.");
		КонецЕсли;
	Иначе
		ЗаписатьЗадачу();
		Оповестить("ОбновитьСписокЗадач");
		ЭтаФорма.Закрыть();
		Оповестить("ЗакрытьФормуСправочники");
	КонецЕсли;
	
	
КонецПроцедуры

&НаСервере
Процедура ЗаписатьЗадачу()
	
	//ТекОб.Вработе = Вработе;
	Если НеДелатьЗапросНаНовыйСрок Тогда
		ТекОб = ТекЗадача.ПолучитьОбъект();
		
		ТекОб.СрокВыполнения = НовыйСрокВыполнения;
		
		//перезаписываем срок задания
		Если ТипЗнч(ТекЗадача.Заявка) = Тип("ДокументСсылка.БП_Поручение") Тогда
			ТекПользователь = БюджетныйНаСервере.ПолучитьПользователя();
			ТекЗаданиеОбъект = ТекЗадача.Заявка.ПолучитьОбъект();
			Для каждого ТекСтрока Из ТекЗаданиеОбъект.СписокИсполнителей Цикл
				Если ТекСтрока.Исполнитель = ТекПользователь Тогда
					ТекСтрока.СрокИсполнения = НовыйСрокВыполнения;
				КонецЕсли;
			КонецЦикла;
			ТекЗаданиеОбъект.Записать();
		КонецЕсли;
		ТекОб.Записать();
		Сообщить(ТекОб.СрокВыполнения);
	КонецЕсли;
	
	
	//БПСервер.ВыполнитьЗадачу(ТекЗадача, , Истина, "Взял в работу.");	
	
КонецПроцедуры


&НаКлиенте
Процедура НовыйСрокВыполненияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ТекДата = ОткрытьФормуМодально("ОбщаяФорма.ФормаВыбораДатыИВремени", Новый Структура("ЗаголовокФормы, ТекДата", "Выберите время", ?(СрокВыполнения > ТекущаяДата(), СрокВыполнения, ТекущаяДата() + 24*60*60))); 
	Если НЕ ТекДата = Неопределено Тогда
		НовыйСрокВыполнения = ТекДата;
		//ВРаботе = Истина;
		Дни = Окр((НовыйСрокВыполнения - СрокВыполнения) / (60 * 60 * 24), 0);
		Отсрочка = ?(Дни > 0, "+", "-") + Дни + " дн.";
		ПользовательРуководительАвтора = БПСервер.ПользовательПодчиненный(БюджетныйНаСервере.ПолучитьПользователя(), ТекАвтор);
		ИсполнительРуководительАвтора = БПСервер.ПользовательПодчиненный(ТекАвтор, БюджетныйНаСервере.ПолучитьПользователя());
		ПользовательАвтор = (НЕ БПСервер.ПолучитьМассивПользователей().Найти(ТекАвтор) = Неопределено);
		Если (НовыйСрокВыполнения > СрокВыполнения И ПользовательРуководительАвтора) ИЛИ ИсполнительРуководительАвтора Тогда
			Элементы.НеДелатьЗапросНаНовыйСрок.Доступность = Истина;
			НеДелатьЗапросНаНовыйСрок = Истина;
		ИначеЕсли ПользовательАвтор Тогда //автору незачем
			Элементы.НеДелатьЗапросНаНовыйСрок.Доступность = ложь;
			НеДелатьЗапросНаНовыйСрок = Истина;
		Иначе
			НеДелатьЗапросНаНовыйСрок = Ложь;
			Элементы.НеДелатьЗапросНаНовыйСрок.Доступность = Истина;
		КонецЕсли;
		Если НовыйСрокВыполнения > СрокВыполнения Тогда
			Элементы.ПричинаОтсрочки.ТолькоПросмотр = Ложь;		
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры




&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ТекЗадача = Параметры.Ключ;
	ТекРеквизиты = БюджетныйНаСервере.ВернутьРеквизиты(ТекЗадача, "БизнесПроцесс, Заявка, СрокВыполнения, ВРаботе, Описание, ДатаНачала"); 
	БизнесПроцесс = ТекРеквизиты.БизнесПроцесс;
	Заявка = ТекРеквизиты.Заявка;
	Описание = ТекРеквизиты.Описание;
	Если Параметры.Свойство("ЭтоУстановкаСрока") Тогда
		ВРаботе = ТекРеквизиты.ВРаботе;
	Иначе
		ВРаботе = Истина;
	КонецЕсли;	
	СрокВыполнения = ТекРеквизиты.СрокВыполнения;
	ДатаНачала = ТекРеквизиты.ДатаНачала;
	
	Если ЗначениеЗаполнено(БизнесПроцесс) Тогда
		ТекАвтор = БизнесПроцесс.Автор;
		ТекЗаявка = БизнесПроцесс;
	ИначеЕсли ЗначениеЗаполнено(Заявка) Тогда
		ТекАвтор = Заявка.Автор;
		ТекЗаявка = Заявка;
	Иначе
		ТекАвтор = ТекЗадача.Автор;
		ТекЗаявка = Заявка;
	КонецЕсли;
	
	НеДелатьЗапросНаНовыйСрок = Истина;
	Элементы.НеДелатьЗапросНаНовыйСрок.Доступность = Ложь;

КонецПроцедуры
